<template>
    <div class="protocal">
      <div class="p-head">
        <strong>用户充值协议</strong>
      </div>
      <div class="p-body">
        <h4>特别提示</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;立讯铠胜服务在此特别提醒您（用户）在充值、使用之前，请认真阅读本《用户协议》，
          确保您充分理解本协议中各条款。请您谨慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，
          否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
        </p>
        <h4>一、充值说明</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户确认，账户已经充值成功，除非发生立讯铠胜服务无法为用户继续服务的情况，在其他任何情况下不能用作除“立讯铠胜服务”平台服务外的任何交易，不能转让他人。
        </p>
        <h4>二、账户管理</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、“立讯铠胜服务”账号的所有权归立讯铠胜服务所有，用户完成申请注册后，获得“立讯铠胜服务”账号的使用权，禁止赠送、借用、租用、转让、或售卖。立讯铠胜服务因经营需要，有权回收用户的“立讯铠胜服务”账号。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、用户有责任妥善保管注册帐号信息及帐号密码的安全,因用户保管不善可能导致遭受盗号或密码失窃，责任由用户自行承担。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，立讯铠胜服务在通知用户后有权依据协议中断或终止对违约用户“立讯铠胜服务”帐号提供服务。同时，立讯铠胜服务保留在任何时候收回“立讯铠胜服务”帐号的权利。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、如用户注册“立讯铠胜服务”帐号后一年内不登录，立讯铠胜服务可收回该帐号，以免造成资源浪费，由此造成的不利后果由用户自行承担。
        </p>
        <h4>三、风险承担</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、不论在任何情况下，立讯铠胜服务对由于互联网正常的设备维护，互联网络连接故障，电脑、通讯或其他系统的故障、电力故障、罢工、暴乱、骚乱、灾难性天气(如火灾、洪水、风暴等)、爆炸、战争、政府行为、司法行政机关的命令或第三方的不作为而造成的不
          能履行或延迟履行服务不承担责任。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、用户理解并同意，因业务发展需要，立讯铠胜服务保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。
        </p>
        <h4>四、法律责任</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、用户理解并同意、立讯铠胜服务有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿立讯铠胜服务与合作公司、关联公司，并使之免受损害。
        </p>
        <h4>五、免责事由</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、用户理解并确认,在使用本服务的过程中,可能会遇到不可抗力等因素,使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件,包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，立讯铠胜服务将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，立讯铠胜服务及合作单位在法律允许的范围內免责。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、本服务同大多数互联网服务一样,受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有木马病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。立讯铠胜服务及合作单位在法律允许的范围內免责。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、用户理解并确认,本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，立讯铠胜服务不承担任何责任。
          <br />
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4、用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，立讯铠胜服务不承担任何责任。
        </p>
        <h4>六、其它</h4>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;立讯铠胜服务郑重提醒用户注意本协议中免除立讯铠胜服务责仼和限制用户权利的条款，请用户仔细阅读,，自主考虑风险。
        </p>
      </div>
    </div>
</template>

<script lang='ts'>
import { ref, reactive , toRefs } from 'vue'
export default {
  components: {
    },
  setup () {
   
    return {
    };
  },
}
</script>
<style lang='scss' scoped>
  .protocal {

.p-head {
  margin-top: 20px;
  text-align: center;
  font-size: 16px;
}

.p-body {
  padding: 0 10px;
  font-size: 14px;
}

.p-foot {
  margin-top: 10px;

  a {
    padding: 10px 0;
    text-align: center;
    font-size: 14px;
    width: 100%;
    display: block;
    border-top: 1px solid rgba(220, 220, 220, 0.5);
    color: #22a7f2;
  }
}
}
</style>